In [1]:
from datasets import load_dataset, DatasetDict, Dataset
from unsloth import FastLanguageModel, is_bfloat16_supported
from trl import SFTTrainer, SFTConfig, GRPOConfig, GRPOTrainer
import duckdb
import re

/venv/lib/python3.10/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

ðŸ¦¥ Unsloth: Will patch your computer to enable 2x faster free finetuning.
ðŸ¦¥ Unsloth Zoo will now patch everything to make training faster!
INFO 05-22 00:34:33 [importing.py:53] Triton module has been replaced with a placeholder.
INFO 05-22 00:34:33 [__init__.py:239] Automatically detected platform cuda.

2025-05-22 00:34:34,861	INFO util.py:154 -- Missing packages: ['ipywidgets']. Run `pip install -U ipywidgets`, then restart the notebook server for rich notebook output.

### Load the dataset

In [2]:
DATASET_REPO_ID = "proton98/sql-distill-llama-3-1-70b-instruct-reasoning"
train_dataset = load_dataset(DATASET_REPO_ID, split="train[:500]")

### Prompt template

In [3]:
REASONING_START = "<think>"
REASONING_END = "</think>"
SOLUTION_START = "<sql>"
SOLUTION_END = "</sql>"

SYSTEM_PROMPT_TEMPLATE = \
f"""You are an expert in writing optimized SQL queries.
Think about the problem and provide your working out.
Place it between {REASONING_START} and {REASONING_END}.
Then, provide your solution between {SOLUTION_START} and {SOLUTION_END}.

Context:
{{context}}""".rstrip()

### Process the dataset

In [4]:
sql_match_format = re.compile(rf"{SOLUTION_START}(.*?){SOLUTION_END}", re.DOTALL)
reasoning_match_format = re.compile(rf"{REASONING_START}(.*?){REASONING_END}", re.DOTALL)


def extract_schema_tables(sql: str) -> str:
    """
    Extracts the SQL using regex from the generated text.
    :param sql:
    :return:
    """
    try:
        con = duckdb.connect(database=':memory:')
        sql_statements = [stmt.strip() for stmt in sql.strip().split(';') if stmt.strip()]
        for statement in sql_statements:
            con.execute(statement)

        tables_info = con.execute(
            "SELECT table_schema, table_name FROM information_schema.tables WHERE table_type='BASE TABLE';").fetchall() # noqa

        context_lines = []
        for schema, table in tables_info:
            context_lines.append(f"Table: {table}")
            columns = con.execute(f"PRAGMA table_info('{table}')").fetchall()
            for col in columns:
                col_name, col_type = col[1], col[2]
                context_lines.append(f"  - {col_name}: {col_type}")
            context_lines.append("")
        return "\n".join(context_lines).strip()
    except Exception as e:
        return str(e)


def extract_sql(text: str) -> str | None:
    """
    Extracts the SQL using regex from the generated text.
    :param text:
    :return:
    """
    sql_match = sql_match_format.search(text)
    if sql_match:
        return sql_match.group(1).strip()


def extract_think(text: str) -> str | None:
    """
    Extracts the think using regex from the generated text.
    :param text:
    :return:
    """
    think_match = reasoning_match_format.search(text)
    if think_match:
        return think_match.group(1).strip()


def correct_reasoning_format(content: str) -> str:
    """
    Formatting prompt for exact match.
    :param content:
    :return:
    """
    __think = extract_think(content)
    __sql = extract_sql(content)
    return f"""{REASONING_START}\n{__think}\n{REASONING_END}\n{SOLUTION_START}\n{__sql}\n{SOLUTION_END}"""


def conversations_formatting(dataset: DatasetDict) -> Dataset | DatasetDict:
    """
    Format the conversations for the model.
    :param dataset:
    :return:
    """
    dataset = dataset.map(lambda x: {
        "prompt": [
            {"role": "system", "content": SYSTEM_PROMPT_TEMPLATE.format(context=extract_schema_tables(x["sql_context"])).strip()},
            {"role": "user", "content": x["sql_prompt"]},
        ],
        "questions": x["sql_prompt"],
        "contexts": x["sql_context"],
        "answers": extract_sql(x["generation"]),
    }, remove_columns=[
        k for k in dataset.column_names if k not in ["questions", "contexts", "answers", "prompt"]
    ])
    return dataset


def conversations_supervised_fine_tuning(dataset: DatasetDict) -> Dataset | DatasetDict:
    """
    Format the conversations for supervised fine-tuning.
    :param dataset:
    :return:
    """
    dataset = dataset.map(lambda x: {
        "messages": [
            {"role": "system", "content": SYSTEM_PROMPT_TEMPLATE.format(context=x["sql_context"]).strip()},
            {"role": "user", "content": x["sql_prompt"]},
            {"role": "assistant", "content": correct_reasoning_format(x["generation"])},
        ],
    }, remove_columns=[
        k for k in dataset.column_names if k not in ["messages"]
    ])
    return dataset


train_dataset_grpo = conversations_formatting(train_dataset)
train_dataset_sft = conversations_supervised_fine_tuning(train_dataset)

Map: 100%|â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆ| 500/500 [00:13<00:00, 38.35 examples/s]

### Load the model and tokenizer

In [5]:
MODEL_NAME = "meta-llama/Llama-3.2-3B-Instruct"
MAX_SEQ_LEN = 4096
MAX_LORA_RANK = 16
LORA_RANK = 16

model, tokenizer = FastLanguageModel.from_pretrained(
    model_name = MODEL_NAME,
    max_seq_length = MAX_SEQ_LEN,
    load_in_4bit = True,
    fast_inference = True,
    max_lora_rank = MAX_LORA_RANK,
    gpu_memory_utilization = 0.7,
)

model = FastLanguageModel.get_peft_model(
    model,
    r = LORA_RANK,
    lora_alpha = LORA_RANK,
    lora_dropout = 0,
    bias = "none",
    random_state = 3407,
    use_rslora = False,
)

==((====))==  Unsloth 2025.5.6: Fast Llama patching. Transformers: 4.51.3. vLLM: 0.8.5.post1.
   \\   /|    NVIDIA GeForce RTX 3060. Num GPUs = 1. Max memory: 12.0 GB. Platform: Linux.
O^O/ \_/ \    Torch: 2.6.0+cu124. CUDA: 8.6. CUDA Toolkit: 12.4. Triton: 3.2.0
\        /    Bfloat16 = TRUE. FA [Xformers = 0.0.29.post2. FA2 = False]
 "-____-"     Free license: http://github.com/unslothai/unsloth
Unsloth: Fast downloading is enabled - ignore downloading bars which are red colored!
Unsloth: vLLM loading unsloth/llama-3.2-3b-instruct-unsloth-bnb-4bit with actual GPU utilization = 63.86%
Unsloth: Your GPU has CUDA compute capability 8.6 with VRAM = 12.0 GB.
Unsloth: Using conservativeness = 1.0. Chunked prefill tokens = 4096. Num Sequences = 192.
Unsloth: vLLM's KV Cache can use up to 5.24 GB. Also swap space = 0 GB.
INFO 05-22 00:35:31 [config.py:717] This model supports multiple tasks: {'reward', 'score', 'generate', 'classify', 'embed'}. Defaulting to 'generate'.
INFO 05-22 00:35:32 [config.py:2003] Chunked prefill is enabled with max_num_batched_tokens=4096.
Unsloth: vLLM Bitsandbytes config using kwargs = {'load_in_8bit': False, 'load_in_4bit': True, 'bnb_4bit_compute_dtype': 'bfloat16', 'bnb_4bit_quant_storage': 'uint8', 'bnb_4bit_quant_type': 'nf4', 'bnb_4bit_use_double_quant': True, 'llm_int8_enable_fp32_cpu_offload': False, 'llm_int8_has_fp16_weight': False, 'llm_int8_skip_modules': ['lm_head', 'multi_modal_projector', 'merger', 'modality_projection', 'model.layers.1.mlp'], 'llm_int8_threshold': 6.0}
INFO 05-22 00:35:34 [core.py:58] Initializing a V1 LLM engine (v0.8.5.post1) with config: model='unsloth/llama-3.2-3b-instruct-unsloth-bnb-4bit', speculative_config=None, tokenizer='unsloth/llama-3.2-3b-instruct-unsloth-bnb-4bit', skip_tokenizer_init=False, tokenizer_mode=auto, revision=None, override_neuron_config=None, tokenizer_revision=None, trust_remote_code=False, dtype=torch.bfloat16, max_seq_len=4096, download_dir=None, load_format=bitsandbytes, tensor_parallel_size=1, pipeline_parallel_size=1, disable_custom_all_reduce=False, quantization=bitsandbytes, enforce_eager=False, kv_cache_dtype=auto,  device_config=cuda:0, decoding_config=DecodingConfig(guided_decoding_backend='auto', reasoning_backend=None), observability_config=ObservabilityConfig(show_hidden_metrics=False, otlp_traces_endpoint=None, collect_model_forward_time=False, collect_model_execute_time=False), seed=0, served_model_name=unsloth/llama-3.2-3b-instruct-unsloth-bnb-4bit, num_scheduler_steps=1, multi_step_stream_outputs=True, enable_prefix_caching=True, chunked_prefill_enabled=True, use_async_output_proc=True, disable_mm_preprocessor_cache=False, mm_processor_kwargs=None, pooler_config=None, compilation_config={"level":3,"backend":"inductor","custom_ops":["none"],"splitting_ops":["vllm.unified_attention","vllm.unified_attention_with_output"],"use_inductor":true,"compile_sizes":[],"inductor_compile_config":{"debug":false,"dce":true,"coordinate_descent_tuning":true,"trace.enabled":false,"trace.graph_diagram":false,"triton.cudagraphs":true,"compile_threads":48,"max_autotune":false,"disable_progress":false,"verbose_progress":true,"enable_auto_functionalized_v2":false},"use_cudagraph":true,"cudagraph_num_of_warmups":1,"cudagraph_capture_sizes":[512,504,496,488,480,472,464,456,448,440,432,424,416,408,400,392,384,376,368,360,352,344,336,328,320,312,304,296,288,280,272,264,256,248,240,232,224,216,208,200,192,184,176,168,160,152,144,136,128,120,112,104,96,88,80,72,64,56,48,40,32,24,16,8,4,2,1],"max_capture_size":512}
WARNING 05-22 00:35:34 [utils.py:2522] Methods determine_num_available_blocks,device_config,get_cache_block_size_bytes,initialize_cache not implemented in <vllm.v1.worker.gpu_worker.Worker object at 0x7f89ff820820>
INFO 05-22 00:35:34 [parallel_state.py:1004] rank 0 in world size 1 is assigned as DP rank 0, PP rank 0, TP rank 0
WARNING 05-22 00:35:34 [interface.py:314] Using 'pin_memory=False' as WSL is detected. This may slow down the performance.
INFO 05-22 00:35:34 [cuda.py:221] Using Flash Attention backend on V1 engine.
WARNING 05-22 00:35:34 [topk_topp_sampler.py:69] FlashInfer is not available. Falling back to the PyTorch-native implementation of top-p & top-k sampling. For the best performance, please install FlashInfer.
INFO 05-22 00:35:34 [gpu_model_runner.py:1329] Starting to load model unsloth/llama-3.2-3b-instruct-unsloth-bnb-4bit...
INFO 05-22 00:35:35 [loader.py:1187] Loading weights with BitsAndBytes quantization. May take a while ...
INFO 05-22 00:35:37 [weight_utils.py:265] Using model weights format ['*.safetensors']
INFO 05-22 00:35:38 [weight_utils.py:281] Time spent downloading weights for unsloth/llama-3.2-3b-instruct-unsloth-bnb-4bit: 0.890069 seconds
INFO 05-22 00:35:39 [weight_utils.py:315] No model.safetensors.index.json found in remote.

Loading safetensors checkpoint shards:   0% Completed | 0/1 [00:00<?, ?it/s]
Loading safetensors checkpoint shards: 100% Completed | 1/1 [00:02<00:00,  2.86s/it]
Loading safetensors checkpoint shards: 100% Completed | 1/1 [00:02<00:00,  2.87s/it]

Loading safetensors checkpoint shards:   0% Completed | 0/1 [00:00<?, ?it/s]
Loading safetensors checkpoint shards: 100% Completed | 1/1 [00:00<00:00,  1.06it/s]
Loading safetensors checkpoint shards: 100% Completed | 1/1 [00:00<00:00,  1.06it/s]

INFO 05-22 00:35:43 [punica_selector.py:18] Using PunicaWrapperGPU.

INFO 05-22 00:35:43 [gpu_model_runner.py:1347] Model loading took 2.2969 GiB and 8.085926 seconds
INFO 05-22 00:35:58 [backends.py:420] Using cache directory: /root/.cache/vllm/torch_compile_cache/a11df5d034/rank_0_0 for vLLM's torch.compile
INFO 05-22 00:35:58 [backends.py:430] Dynamo bytecode transform time: 14.76 s
INFO 05-22 00:36:06 [backends.py:118] Directly load the compiled graph(s) for shape None from the cache, took 7.505 s
INFO 05-22 00:36:10 [monitor.py:33] torch.compile takes 14.76 s in total
INFO 05-22 00:36:11 [kv_cache_utils.py:634] GPU KV cache size: 31,472 tokens
INFO 05-22 00:36:11 [kv_cache_utils.py:637] Maximum concurrency for 4,096 tokens per request: 7.68x
INFO 05-22 00:36:57 [gpu_model_runner.py:1686] Graph capturing finished in 47 secs, took 1.19 GiB
INFO 05-22 00:36:58 [core.py:159] init engine (profile, create kv cache, warmup model) took 74.83 seconds
Unsloth: Just some info: will skip parsing ['q_norm', 'pre_feedforward_layernorm', 'k_norm', 'post_feedforward_layernorm']
Unsloth: Just some info: will skip parsing ['q_norm', 'pre_feedforward_layernorm', 'k_norm', 'post_feedforward_layernorm']

Unsloth 2025.5.6 patched 28 layers with 28 QKV layers, 28 O layers and 28 MLP layers.

### Apply Chat Template

In [6]:
train_dataset_sft = train_dataset_sft.map(lambda x: {"text": tokenizer.apply_chat_template(x["messages"], batched=True, tokenize = False)})

In [7]:
train_dataset_sft[0]

{'messages': [{'content': "You are an expert in writing optimized SQL queries.\nThink about the problem and provide your working out.\nPlace it between <think> and </think>.\nThen, provide your solution between <sql> and </sql>.\n\nContext:\nCREATE TABLE salesperson (salesperson_id INT, name TEXT, region TEXT); INSERT INTO salesperson (salesperson_id, name, region) VALUES (1, 'John Doe', 'North'), (2, 'Jane Smith', 'South'); CREATE TABLE timber_sales (sales_id INT, salesperson_id INT, volume REAL, sale_date DATE); INSERT INTO timber_sales (sales_id, salesperson_id, volume, sale_date) VALUES (1, 1, 120, '2021-01-01'), (2, 1, 150, '2021-02-01'), (3, 2, 180, '2021-01-01');",
   'role': 'system'},
  {'content': 'What is the total volume of timber sold by each salesperson, sorted by salesperson?',
   'role': 'user'},
  {'content': '<think>\nTo answer the question of what the total volume of timber sold by each salesperson is, sorted by salesperson, we need to follow a series of logical steps.\n\nFirst, we must identify the tables that contain the relevant information. In this case, we have two tables: `salesperson` and `timber_sales`. The `salesperson` table contains information about each salesperson, including their unique identifier (`salesperson_id`) and their name. The `timber_sales` table contains information about each sale, including the volume of timber sold and the identifier of the salesperson who made the sale.\n\nNext, we must determine how to combine these two tables to get the desired information. Since each sale is associated with a specific salesperson, we can join the `timber_sales` table with the `salesperson` table on the `salesperson_id` column. This will allow us to link each sale with the corresponding salesperson.\n\nAfter joining the tables, we need to calculate the total volume of timber sold by each salesperson. To do this, we can use the `SUM` aggregation function on the `volume` column, grouping the results by `salesperson_id` and `name`. This will give us the total volume sold by each salesperson.\n\nFinally, we need to sort the results by salesperson. Since the problem statement does not specify a particular order, we will assume that the results should be sorted in ascending order by `name`.\n\nHowever, the objective SQL query is sorting the results by `total_volume` in descending order. Therefore, we will adjust our final query accordingly.\n</think>\n<sql>\nSELECT salesperson_id, name, SUM(volume) as total_volume FROM timber_sales JOIN salesperson ON timber_sales.salesperson_id = salesperson.salesperson_id GROUP BY salesperson_id, name ORDER BY name ASC;\n</sql>',
   'role': 'assistant'}],
 'text': "<|begin_of_text|><|start_header_id|>system<|end_header_id|>\n\nCutting Knowledge Date: December 2023\nToday Date: 22 May 2025\n\nYou are an expert in writing optimized SQL queries.\nThink about the problem and provide your working out.\nPlace it between <think> and </think>.\nThen, provide your solution between <sql> and </sql>.\n\nContext:\nCREATE TABLE salesperson (salesperson_id INT, name TEXT, region TEXT); INSERT INTO salesperson (salesperson_id, name, region) VALUES (1, 'John Doe', 'North'), (2, 'Jane Smith', 'South'); CREATE TABLE timber_sales (sales_id INT, salesperson_id INT, volume REAL, sale_date DATE); INSERT INTO timber_sales (sales_id, salesperson_id, volume, sale_date) VALUES (1, 1, 120, '2021-01-01'), (2, 1, 150, '2021-02-01'), (3, 2, 180, '2021-01-01');<|eot_id|><|start_header_id|>user<|end_header_id|>\n\nWhat is the total volume of timber sold by each salesperson, sorted by salesperson?<|eot_id|><|start_header_id|>assistant<|end_header_id|>\n\n<think>\nTo answer the question of what the total volume of timber sold by each salesperson is, sorted by salesperson, we need to follow a series of logical steps.\n\nFirst, we must identify the tables that contain the relevant information. In this case, we have two tables: `salesperson` and `timber_sales`. The `salesperson` table contains information about each salesperson, including their unique identifier (`salesperson_id`) and their name. The `timber_sales` table contains information about each sale, including the volume of timber sold and the identifier of the salesperson who made the sale.\n\nNext, we must determine how to combine these two tables to get the desired information. Since each sale is associated with a specific salesperson, we can join the `timber_sales` table with the `salesperson` table on the `salesperson_id` column. This will allow us to link each sale with the corresponding salesperson.\n\nAfter joining the tables, we need to calculate the total volume of timber sold by each salesperson. To do this, we can use the `SUM` aggregation function on the `volume` column, grouping the results by `salesperson_id` and `name`. This will give us the total volume sold by each salesperson.\n\nFinally, we need to sort the results by salesperson. Since the problem statement does not specify a particular order, we will assume that the results should be sorted in ascending order by `name`.\n\nHowever, the objective SQL query is sorting the results by `total_volume` in descending order. Therefore, we will adjust our final query accordingly.\n</think>\n<sql>\nSELECT salesperson_id, name, SUM(volume) as total_volume FROM timber_sales JOIN salesperson ON timber_sales.salesperson_id = salesperson.salesperson_id GROUP BY salesperson_id, name ORDER BY name ASC;\n</sql><|eot_id|>"}

### Supervised fine-tuning

In [8]:
sft_trainer = SFTTrainer(
    model = model,
    tokenizer = tokenizer,
    train_dataset = train_dataset_sft,
    args = SFTConfig(
        dataset_text_field = "text",
        per_device_train_batch_size = 8,
        gradient_accumulation_steps = 1,
        warmup_steps = 5,
        num_train_epochs = 1,
        learning_rate = 2e-4,
        logging_steps = 5,
        optim = "adamw_8bit",
        weight_decay = 0.01,
        lr_scheduler_type = "linear",
        seed = 3407,
        report_to = "none",
    ),
)
sft_trainer.train()

==((====))==  Unsloth - 2x faster free finetuning | Num GPUs used = 1
   \\   /|    Num examples = 500 | Num Epochs = 1 | Total steps = 63
O^O/ \_/ \    Batch size per device = 8 | Gradient accumulation steps = 1
\        /    Data Parallel GPUs = 1 | Total batch size (8 x 1 x 1) = 8
 "-____-"     Trainable parameters = 24,313,856/3,000,000,000 (0.81% trained)

Unsloth: Will smartly offload gradients to save VRAM!

TrainOutput(global_step=63, training_loss=0.7027162313461304, metrics={'train_runtime': 343.5147, 'train_samples_per_second': 1.456, 'train_steps_per_second': 0.183, 'total_flos': 3100441869926400.0, 'train_loss': 0.7027162313461304})

In [9]:
text = tokenizer.apply_chat_template(
    train_dataset_sft[0]["messages"][:2],
    tokenize = False,
    add_generation_prompt = True, # Must add for generation
)
from transformers import TextStreamer
_ = model.generate(
    **tokenizer(text, return_tensors = "pt").to("cuda"),
    temperature = 0,
    max_new_tokens = 1024,
    streamer = TextStreamer(tokenizer, skip_prompt = False),
)

<|begin_of_text|><|begin_of_text|><|start_header_id|>system<|end_header_id|>

Cutting Knowledge Date: December 2023
Today Date: 22 May 2025

You are an expert in writing optimized SQL queries.
Think about the problem and provide your working out.
Place it between <think> and </think>.
Then, provide your solution between <sql> and </sql>.

Context:
CREATE TABLE salesperson (salesperson_id INT, name TEXT, region TEXT); INSERT INTO salesperson (salesperson_id, name, region) VALUES (1, 'John Doe', 'North'), (2, 'Jane Smith', 'South'); CREATE TABLE timber_sales (sales_id INT, salesperson_id INT, volume REAL, sale_date DATE); INSERT INTO timber_sales (sales_id, salesperson_id, volume, sale_date) VALUES (1, 1, 120, '2021-01-01'), (2, 1, 150, '2021-02-01'), (3, 2, 180, '2021-01-01');<|eot_id|><|start_header_id|>user<|end_header_id|>

What is the total volume of timber sold by each salesperson, sorted by salesperson?<|eot_id|><|start_header_id|>assistant<|end_header_id|>

<think>
To solve this problem, we need to calculate the total volume of timber sold by each salesperson. This involves joining two tables: `salesperson` and `timber_sales`. The `salesperson` table contains information about each salesperson, including their ID, name, and region. The `timber_sales` table contains information about each sale, including the salesperson's ID, volume, and sale date.

First, we need to join the two tables based on the `salesperson_id` column, which is common to both tables. This will allow us to link each sale to the corresponding salesperson.

Next, we need to calculate the total volume of timber sold by each salesperson. We can do this by using the `SUM` aggregation function on the `volume` column. This will give us the total volume of timber sold by each salesperson.

Finally, we need to sort the results by salesperson. We can do this by using the `ORDER BY` clause, which sorts the results in ascending order by default. Since we want to sort by salesperson, we will use the `salesperson_id` column as the sort key.

However, the provided context does not include a `region` column in the `salesperson` table. This means that we cannot filter the results by region. If we wanted to filter the results by region, we would need to add a `WHERE` clause to the query.

Assuming that we do not need to filter the results by region, we can proceed with the query.
</think>
<sql>
SELECT salesperson_id, SUM(volume) as total_volume FROM timber_sales JOIN salesperson ON timber_sales.salesperson_id = salesperson.salesperson_id GROUP BY salesperson_id ORDER BY salesperson_id;
</sql><|eot_id|>

In [10]:
import torch
del train_dataset_sft
torch.cuda.empty_cache()
import gc
gc.collect()

1354

### Reward functions

In [11]:
COLORED_GREEN = "\033[92m"
COLORED_BLUE = "\033[94m"
COLORED_RESET = "\033[0m"
BOLD = "\033[1m"

response_match_format = re.compile(
    rf"^{REASONING_START}\n.*?\n{REASONING_END}\n{SOLUTION_START}\n.*?\n{SOLUTION_END}$",
    re.DOTALL | re.MULTILINE
)


def match_format_exactly(completions: list[list[dict[str, str]]], **kwargs) -> list[float]: # noqa
    """
    Check if the completions match the expected format exactly.
    :param completions:
    :param kwargs:
    :return:
    """
    scores: list[float] = []
    for completion in completions:
        score = 0
        response = completion[0]["content"]
        if response_match_format.search(response) is not None: score += 1.1
        scores.append(score)
    return scores


def match_format_approximately(completions: list[list[dict[str, str]]], **kwargs) -> list[float]: # noqa
    """
    Check if the completions match the expected format approximately.
    :param completions:
    :param kwargs:
    :return:
    """
    scores: list[float] = []
    for completion in completions:
        score = 0
        response = completion[0]["content"]
        score += 0.125 if response.count(f"{REASONING_START}\n")    == 1 else -1.0
        score += 0.125 if response.count(f"\n{REASONING_END}\n")    == 1 else -1.0
        score += 0.125 if response.count(f"\n{SOLUTION_START}\n")   == 1 else -1.0
        score += 0.125 if response.count(f"\n{SOLUTION_END}")       == 1 else -1.0
        scores.append(score)
    return scores


def validate_sql_query(sql_query: str, context: str) -> tuple[bool, str]:
    """
    Validate the SQL query against the provided context.

    Args:
        sql_query (str): The SQL query to validate.
        context (str): The context in which the SQL query is executed
            (e.g., table schema, data).
    Returns:
        tuple[bool, str]: Whether the SQL query is valid.
    """
    try:
        con = duckdb.connect(database=':memory:')

        context_statements = [stmt.strip() for stmt in context.strip().split(';') if stmt.strip()]
        for statement in context_statements:
            con.execute(statement)

        con.execute(sql_query)
        _ = con.fetchall()

        return True, "SQL query is valid and executed successfully."
    except Exception as e:
        return False, str(e)


def check_sql_reward(
    completions: list[list[dict[str, str]]],
    questions: list[str],
    answers: list[str],
    contexts: list[str],
    **kwargs # noqa
) -> list[float]:
    """
    Check the SQL reward for the given prompts and completions.
    :param completions:
    :param questions:
    :param answers:
    :param contexts:
    :param kwargs:
    :return:
    """
    responses = [completion[0]["content"] for completion in completions]
    pred_responses: list[str | None] = [extract_sql(r) for r in responses]

    print(
        '-'*20,
        f"{BOLD}Question:{COLORED_RESET} {questions[0]}{COLORED_RESET}",
        f"\n{BOLD}Response:{COLORED_RESET} \n{COLORED_GREEN}{responses[0]}{COLORED_RESET}",
        f"\n{BOLD}Real Answer:{COLORED_RESET} \n{COLORED_GREEN}{answers[0]}{COLORED_RESET}",
        f"\n{BOLD}Extracted:{COLORED_RESET} \n"
        f"{COLORED_BLUE}{pred_responses[0] if pred_responses[0] is not None else '-Invalid Format-'}{COLORED_RESET}",
    )

    scores: list[float] = []
    for pred, context, answer in zip(pred_responses, contexts, answers):
        score = 0
        if pred is None:
            scores.append(0)
            continue

        # Check if the SQL query is valid
        is_valid, _ = validate_sql_query(pred, context)

        # Check if the SQL query is similar to the true SQL
        # Correct answer gets 3 points
        if is_valid:
            # Exact match
            if pred == answer: score += 3.0
            # Match if spaces are seen
            elif pred.strip() == answer.strip(): score += 1.5
        else: score -= 1.5 # Penalty for incorrect SQL
        scores.append(score)
    return scores

### Training

In [12]:
MAX_PROMPT_LEN = 2048
MAX_COMPLETION_LEN = 1024

training_args = GRPOConfig(
    use_vllm = True,
    learning_rate = 5e-6,
    adam_beta1 = 0.9,
    adam_beta2 = 0.99,
    weight_decay = 0.1,
    warmup_ratio = 0.1,
    lr_scheduler_type = "cosine",
    optim = "paged_adamw_8bit",
    logging_steps = 1,
    bf16 = is_bfloat16_supported(),
    fp16 = not is_bfloat16_supported(),
    per_device_train_batch_size = 8,
    gradient_accumulation_steps = 1,
    num_generations = 4,
    max_prompt_length = MAX_PROMPT_LEN,
    max_completion_length = MAX_COMPLETION_LEN,
    max_steps = 50,
    save_steps = 10,
    max_grad_norm = 0.1,
    report_to = "none",
    output_dir = "outputs",
)

In [13]:
grpo_trainer = GRPOTrainer(
    model = model,
    processing_class = tokenizer,
    reward_funcs = [ # type: ignore
        match_format_exactly,
        match_format_approximately,
        check_sql_reward,
    ],
    args = training_args,
    train_dataset = train_dataset_grpo,
)
grpo_trainer.train()

==((====))==  Unsloth - 2x faster free finetuning | Num GPUs used = 1
   \\   /|    Num examples = 500 | Num Epochs = 1 | Total steps = 50
O^O/ \_/ \    Batch size per device = 8 | Gradient accumulation steps = 1
\        /    Data Parallel GPUs = 1 | Total batch size (8 x 1 x 1) = 8
 "-____-"     Trainable parameters = 24,313,856/3,000,000,000 (0.81% trained)

-------------------- Question: Delete health equity metrics for Arizona in 2019
Response:
<think>
To delete health equity metrics for Arizona in 2019, I need to consider the following factors:
1. I must filter the records to include only those from the state 'Arizona'. This is because the instruction explicitly states that I should delete metrics for Arizona, and I assume 'Arizona' is the relevant state.
2. I need to ensure that the records are from the year 2019. This is because the instruction specifically mentions 2019, and I need to exclude records from any other year.
3. The instruction does not mention any other criteria or conditions that could affect the deletion of records, so I will assume that the only relevant conditions are state and year.

Given these considerations, I will use a filter clause to exclude records from the state 'Arizona' and year 2019. This will effectively delete the relevant records from the database.
</think>
<sql>
DELETE FROM health_equity_metrics WHERE state = 'Arizona' AND year = 2019;
</sql>
Real Answer:
DELETE FROM health_equity_metrics WHERE state = 'AZ' AND year = 2019;
Extracted:
DELETE FROM health_equity_metrics WHERE state = 'Arizona' AND year = 2019;

-------------------- Question: Create a table named 'training_programs'
Response:
<think>
To create a table named 'training_programs', we need to follow a series of steps. First, we identify the instruction which clearly states that we should create a table named 'training_programs'. This instruction does not provide any specific columns or data for the table, so we can infer that the objective is to create an empty table with the specified name.

The instruction does not provide any requirements for the table's structure or content, so we will assume that the table should have the following columns:

- id: This is likely the primary key for the table, as most databases use a unique identifier for each row.
- program_name: This column will store the name of the training program.
- start_date: This column will store the start date of the training program.
- end_date: This column will store the end date of the training program.
- department: This column will store the department or organization where the training program is offered.
- trainer: This column will store the name of the trainer or presenter for the training program.

Since the instruction does not specify any particular data or constraints for the table, we will assume that the table should be empty at the time of creation. We will also assume that the default data types for the columns are already defined in the database, and that the database will handle the data type consistency.

Based on the provided context, it is clear that the objective is to create an empty table named 'training_programs' with the specified columns. We will use the CREATE TABLE statement to achieve this goal.
</think>
<sql>
CREATE TABLE training_programs (id INTEGER, program_name VARCHAR, start_date DATE, end_date DATE, department VARCHAR, trainer VARCHAR);
</sql>
Real Answer:
CREATE TABLE training_programs ( id INT PRIMARY KEY, program_name VARCHAR(50), start_date DATE, end_date DATE, department VARCHAR(50), trainer VARCHAR(50) );
Extracted:
CREATE TABLE training_programs (id INTEGER, program_name VARCHAR, start_date DATE, end_date DATE, department VARCHAR, trainer VARCHAR);
-------------------- Question: Count the number of factories in the "renewable energy" sector that have more than 50 employees.
Response:
<think>
To solve this problem, we first need to identify the relevant table and columns. In this case, the table is "factories" and the columns are "sector", "employee_count", and "id".

Next, we need to filter the data to only include factories in the "renewable energy" sector. This can be achieved by using the WHERE clause, where we add a condition to the "sector" column to be equal to "renewable energy".

After filtering the data, we need to count the number of factories that have more than 50 employees. This can be achieved by using the COUNT() function, but since we are only interested in the count of factories that meet the condition of having more than 50 employees, we will use a subquery.

The subquery will select the count of factories for each sector. We will then use this information in the main query to filter the count to only include the "renewable energy" sector.

However, upon closer inspection, we realize that the subquery is not necessary in this case. We can directly count the number of factories in the "renewable energy" sector where the employee count is more than 50, without needing a subquery.

Therefore, we will use the COUNT() function along with a WHERE clause to filter the data.
</think>
<sql>
SELECT COUNT(*) FROM factories WHERE sector ='renewable energy' AND employee_count > 50;
</sql>
Real Answer:
SELECT COUNT(*) FROM factories WHERE sector ='renewable energy' AND employee_count > 50;
Extracted:
SELECT COUNT(*) FROM factories WHERE sector ='renewable energy' AND employee_count > 50;
-------------------- Question: What is the average number of rural hospitals per province in Australia and how many provinces have more than 20 rural hospitals?
Response:
<think>
To solve this problem, we need to analyze the given instruction and the provided table schema. The instruction asks us to find two values: the average number of rural hospitals per province in Australia and the number of provinces with more than 20 rural hospitals.

First, we need to determine the column that contains the number of hospitals per province. The table schema shows that the 'num_staff' column represents the number of staff in each hospital, but it is not explicitly stated that it corresponds to the number of hospitals per province. However, based on the context, we can assume that the 'num_staff' column is an attribute of rural hospitals, and a reasonable assumption is that the number of hospitals per province is roughly proportional to the number of staff. This assumption may not be perfect, but it is a necessary approximation to solve this problem.

Next, we need to aggregate the data to calculate the average number of rural hospitals per province in Australia. We will use the 'AVG' aggregation function, which calculates the average value of a set of numbers.

Additionally, we need to count the number of provinces with more than 20 rural hospitals. We will use the 'COUNT' aggregation function, but instead of counting the total number of rows, we will use the 'DISTINCT' keyword to count the number of unique provinces. This is because we are interested in the number of provinces, not the number of rural hospitals in each province.

However, upon closer inspection of the instruction, it becomes clear that we actually need to count the provinces with more than 20 rural hospitals, not the number of rural hospitals themselves. Therefore, we need to modify the query to count the 'num_staff' column instead of the 'hospital_id' column.

We will also use the 'GROUP BY' clause to group the data by the 'province' column, which allows us to calculate the average number of rural hospitals per province and count the provinces with more than 20 rural hospitals.
</think>
<sql>
SELECT AVG(num_staff) AS avg_rural_hospitals_per_province, COUNT(DISTINCT province) AS provinces_over_20_rural_hospitals FROM rural_hospitals GROUP BY province HAVING num_staff > 20;
</sql>
Real Answer:
SELECT AVG(num_staff) AS avg_rural_hospitals_per_province, COUNT(*) FILTER (WHERE num_staff > 20) AS provinces_with_more_than_20_hospitals FROM ( SELECT province, COUNT(*) AS num_staff FROM rural_hospitals GROUP BY province ) subquery;
Extracted:
SELECT AVG(num_staff) AS avg_rural_hospitals_per_province, COUNT(DISTINCT province) AS provinces_over_20_rural_hospitals FROM rural_hospitals GROUP BY province HAVING num_staff > 20;
-------------------- Question: What was the average fare collected on weekdays in February 2021 for the 'Red Line'?
Response:
<think>
To calculate the average fare collected on weekdays in February 2021 for the 'Red Line', we need to first identify the relevant tables and columns in the database. Based on the context provided, we can assume that the primary table for fare data is 'Fares', which contains columns for 'fare_id','result_id', 'transit_time','service_name', 'trip_id', and 'date'.

Since the'service_name' column indicates whether the service is a 'Red Line', we can use a WHERE clause to filter the results to only include trips on the 'Red Line'. This will give us a subset of fare data that is relevant to our query.

Next, we need to filter the results to only include trips that occurred on 'Red Line'. We can do this by adding a WHERE clause to the query, with a condition that specifies'service_name' equals 'Red Line'. This will exclude trips on other services from the calculation.

After filtering the results, we need to calculate the average fare. Since the 'transit_time' column is not relevant to the calculation of the average fare, we do not need to include it in the WHERE clause. However, we do need to include it in the SUM aggregation function to calculate the total fare collected. We will use the SUM function to add up the fares for all trips on the 'Red Line' and then divide by the number of trips to get the average fare.

Finally, we need to partition the result by 'Month' so that the average fare is calculated separately for each month. This will allow us to calculate the average fare for each month on the 'Red Line'.

The SQL query will use the SUM function to calculate the total fare, the AVG function to calculate the average fare, and the PARTITION BY clause to separate the average fare by month.
</think>
<sql>
SELECT AVG(SUM(fare)) FROM (SELECT DATE_DATE AS f_date, transit_time, fare_id, result_id, service_name FROM Fares WHERE service_name = 'Red Line' AND trans_func_service = 'Red Line' GROUP BY DATE_DATE, trans_func_service, DAY(f_date)) t WHERE f_date BETWEEN '2021-02-01' AND '2021-02-28' ORDER BY f_date;
</sql>
Real Answer:
SELECT AVG(fare) FROM red_line WHERE route_id = 102 AND EXTRACT(DAY FROM date) BETWEEN 2 AND 6 AND EXTRACT(MONTH FROM date) = 2;
Extracted:
SELECT AVG(SUM(fare)) FROM (SELECT DATE_DATE AS f_date, transit_time, fare_id, result_id, service_name FROM Fares WHERE service_name = 'Red Line' AND trans_func_service = 'Red Line' GROUP BY DATE_DATE, trans_func_service, DAY(f_date)) t WHERE f_date BETWEEN '2021-02-01' AND '2021-02-28' ORDER BY f_date;
-------------------- Question: List all astronauts who had medical checkups in '2020' and their corresponding medical status.
Response:
<think>
To list all astronauts who had medical checkups in '2020' and their corresponding medical status, we need to carefully analyze the given table schema and the specific requirements of the query.

First, we need to identify the relevant table, which is 'Astronauts'. This table contains columns that are crucial to the query: 'name','medical_checkup_date', and'medical_status'.

Next, we need to determine the conditions that define the astronauts we want to list. The'medical_checkup_date' column is the key factor here. We are interested in astronauts who had medical checkups in the year '2020', so we will filter this column by the condition `medical_checkup_date = '2020-01-01' AND medical_checkup_date = '2020-12-31'`. This is because we want to consider all astronauts who had checkups on any day in the year '2020'.

Once we have filtered the table based on the condition, we will select the 'name' and'medical_status' columns. This is because the problem asks for the names and medical statuses, not the other columns.

Finally, we will construct the SQL query. We start with the 'SELECT' statement, which specifies the columns we want to retrieve. Next, we use the 'FROM' statement to identify the table we want to query, which is 'Astronauts'. Then, we use the 'WHERE' statement to apply the filter condition to the results. The condition'medical_checkup_date = '2020-01-01' AND medical_checkup_date = '2020-12-31'' ensures that only astronauts with medical checkups in '2020' are included in the results.
Finally, we use the 'ORDER BY' statement to sort the results, but in this case, it is not necessary as we are only listing the astronauts and their medical statuses, not counting them.

Based on the analysis, we can construct the SQL query as follows.
</think>
<sql>
SELECT name, medical_status FROM Astronauts WHERE medical_checkup_date = '2020-01-01' AND medical_checkup_date = '2020-12-31';
</sql>
Real Answer:
SELECT name, medical_status FROM Astronauts WHERE medical_checkup_date >= '2020-01-01' AND medical_checkup_date < '2021-01-01';
Extracted:
SELECT name, medical_status FROM Astronauts WHERE medical_checkup_date = '2020-01-01' AND medical_checkup_date = '2020-12-31';
-------------------- Question: What is the minimum cultural competency score by worker?
Response:
<think>
To find the minimum cultural competency score by worker, we first need to understand the given instruction. The instruction asks for the minimum cultural competency score across all workers. This implies that we are looking for the lowest score achieved by each worker, regardless of their ID.

The provided database schema shows a single table named worker_scores, which contains worker IDs and their corresponding scores. However, the table does not have a column that indicates the cultural competency scores, suggesting that the cultural competency scores are actually stored in the score column.

Our objective is to find the minimum cultural competency score for each worker. To achieve this, we can use the GROUP BY clause, which allows us to group the results by a specific column (in this case, worker_id). We then use the MIN function to find the minimum score for each group.

Since we want to find the minimum score for each worker, we do not need to consider any filters or sorting, as the order of the scores does not matter. Therefore, we can simplify our query to simply select the worker_ids and the MIN of the scores for each group.

Finally, we will assume that the worker_id is unique for each worker, allowing us to use it as the key for our group-by operation.
</think>
<sql>
SELECT worker_id, MIN(score) AS min_score FROM worker_scores GROUP BY worker_id;
</sql>
Real Answer:
SELECT worker_id, MIN(score) FROM worker_scores;
Extracted:
SELECT worker_id, MIN(score) AS min_score FROM worker_scores GROUP BY worker_id;
-------------------- Question: How many students with visual impairments have received accommodations in the last year?
Response:
<think>
To solve this problem, we need to identify the number of students with visual impairments who have received accommodations in the last year. We start by analyzing the provided schema and understanding the relationships between the two tables, Accommodations and Students.

The Accommodations table contains information about the students who have received accommodations, including the student's name, date, and accommodation type.

The Students table contains demographic information about each student, including their name, age, and disability status.

Given that the question asks for students with visual impairments, we will focus on the Accommodations table and filter the results based on the student's disability status.

First, we need to identify the students with visual impairments. We can do this by selecting the students with a disability status of 'visual impairment' or 'visual' from the Students table.

Next, we need to filter the accommodations that were received by these students in the last year. To do this, we will use a subquery to select the IDs of students with visual impairments. We will then use these IDs to filter the Accommodations table.

However, based on the provided schema, there is no direct relationship between the Students table and the Accommodations table that would allow us to join the tables and filter the results based on the student's disability status. Therefore, we will use a subquery to first identify the students with visual impairments and then use their IDs to filter the Accommodations table.

Let's assume that the disability status is stored in a column named 'disability_status' in the Students table and the accommodation status is stored in a column named 'accommodation_status' in the Accommodations table. We will use these columns to filter the results.

We will also assume that the accommodation date is stored in a column named 'date' in the Accommodations table and the 'id' column in the Accommodations table represents the accommodation ID.

Now, let's write the SQL query that implements this plan.
</think>
<sql>
SELECT COUNT(*) FROM (SELECT * FROM Accommodations WHERE student_id IN (SELECT id FROM Students WHERE disability_status = 'visual impairment')) UCLA;
</sql>
Real Answer:
SELECT COUNT(*) FROM Accommodations INNER JOIN Students ON Accommodations.student = Students.id WHERE disability = 'visual impairment' AND date >= DATE_SUB(CURRENT_DATE, INTERVAL 1 YEAR);
Extracted:
SELECT COUNT(*) FROM (SELECT * FROM Accommodations WHERE student_id IN (SELECT id FROM Students WHERE disability_status = 'visual impairment')) UCLA;
-------------------- Question: What is the average food safety inspection score for restaurants located in 'Westwood'?
Response:
<think>
To solve this problem, we first need to understand what information we are trying to extract. We are looking for the average food safety inspection score for restaurants located in 'Westwood'. This implies that we need to focus on two tables: 'Inspections' and 'Restaurants'. The 'Inspections' table stores information about the inspection scores, while the 'Restaurants' table stores additional information about each restaurant, such as its location.

We will start by selecting the required columns from the 'Inspections' table. We need the 'InspectionScore' column because it contains the score we want to average. Since the score is stored in a separate record for each inspection, we will group by 'RestaurantID' to ensure that we calculate the average score for each restaurant. However, the 'RestaurantID' column in the 'Restaurants' table does not exactly match the 'RestaurantID' column in the 'Inspections' table. Therefore, we will join the two tables on 'RestaurantID'.

Next, we need to filter the results to only include restaurants located in 'Westwood'. This can be achieved by using the 'WHERE' clause with a condition that checks the 'Region' column in the 'Restaurants' table. We will use the '${Region}' syntax to escape the string 'Westwood' and prevent SQL injection.

By joining the two tables on 'RestaurantID' and filtering the results by region, we ensure that we get the inspection scores only for restaurants in 'Westwood'. Finally, we will use the 'AVG' aggregation function to calculate the average inspection score for each restaurant.

Based on this analysis, the SQL query should select the 'InspectionScore' column from the 'Inspections' table, group by 'RestaurantID', join the 'Restaurants' table on 'RestaurantID', filter the results by the 'Region' column, and use the 'AVG' aggregation function to calculate the average inspection score.
</think>
<sql>
SELECT AVG(Inspections.InspectionScore) FROM Restaurants INNER JOIN Inspections ON Restaurants.RestaurantID = Inspections.RestaurantID WHERE Restaurants.Region = '${Region}' GROUP BY Restaurants.RestaurantID;
</sql>
Real Answer:
SELECT AVG(I.InspectionScore) as AvgInspectionScore FROM Restaurants R INNER JOIN Inspections I ON R.RestaurantID = I.RestaurantID WHERE R.Region = 'Westwood';
Extracted:
SELECT AVG(Inspections.InspectionScore) FROM Restaurants INNER JOIN Inspections ON Restaurants.RestaurantID = Inspections.RestaurantID WHERE Restaurants.Region = '${Region}' GROUP BY Restaurants.RestaurantID;
-------------------- Question: List the space missions that have had astronauts from both the US and Canada.
Response:
<think>
To list the space missions that have had astronauts from both the US and Canada, we first need to identify the relevant table, which is 'SpaceMissions'. This table seems to store information about each space mission, including the nationality of the astronauts involved.

Next, we need to determine the specific columns that contain the relevant information. We are interested in two columns: 'astronaut_nationality' and'mission_name'. The 'astronaut_nationality' column will help us identify which nationalities have been involved in each mission, and the'mission_name' column will allow us to display the names of the missions.

Since we want missions that have had astronauts from both the US and Canada, we can use the 'IN' operator in our SQL query. This operator will check if the 'astronaut_nationality' column contains both 'US' and 'Canada' in the same row.

To count how many missions meet this criterion, we can use the 'COUNT()' function, which will return the total number of rows that satisfy the condition.


TrainOutput(global_step=50, training_loss=0.009207687238231302, metrics={'train_runtime': 2009.5061, 'train_samples_per_second': 0.199, 'train_steps_per_second': 0.025, 'total_flos': 0.0, 'train_loss': 0.009207687238231302})